# day07

# 평균과 극단값
#   평균은 극단값의 영향을 많이 받는다.
#   중앙값은 극단값의 영향을 받지 않는다.
#   ==> 극단값이 존재하는 경우 평균보다는 중앙값이 중심을 더 잘 나타낸다.

# 제곱근-평균-제곱(RMS, Root Mean Square)
#   RMS = √숫자들의제곱의평균

# 표준편차
# : 평균으로부터의 편차들
# ==> 관측치들이 평균으로부터 얼마나 떨어져있는지를 알려준다.

# 68 - 95법칙
#   관측치들의 68%정도는 평균으로부터 1 표준편차(SD) 이내로 떨어져있다.
#   관측치들의 95%정도는 평균으로부터 2 표준편차(SD) 이내로 떨어져있다.

# 자유도
# 자유도는 합쳐진 값들 중에서 실질적으로 독립인 값들의 갯수
# 표준편차를 계산하는 경우 자유도는 "자료의 갯수 - 1"
# 표준편차 계산의 대상이되는 편차들의 합은 0이 된다.
# 편차들의 합이 0이 된다는 것은 하나의 제약조건이 자유도를 1만큼 감소시킨다.


# 측정오차(measurement error)
#     관측치와 실제값의 차이
#     측정오차가 존재하면, 관측치 = 실제값 + 측정오차
#     측정오차의 대략적인 크기는 관측치의 표준편차(SD)를 통해서 알 수 있다.
#     표준편차(SD)의 크기는 한 번의 관측에서 측정오차가 어느정도 될지 알려준다.

# 편의(bias)
#       방향성을 가지는 하나의 체계적인 오차
#       측정오차와 함께 편의가 있으면, 관측치 = 실제값 + 편의 + 측정오차

# 이탈값(outlier)
#       극단적인 관측치

################################################################################
# Z-Score(Z-점수, 표준점수:standard score)
#   각 자료값을 평균을 중심으로 한 상대적인 위치로 반환한 척도

# 모집단 Z-Score  : Zi = (xi - )

# 표본의 Z-Score









